app/views/product_categories/_form.html.erb

SELECT "tags".* FROM "tags"
---
    <%= form.label :tag %>
    <%= collection_select(:product_category, :tag_id, Tag.all, :id, :name) %>