app/controllers/product_categories_controller.rb

  def index
    @product_categories = ProductCategory.all
---
SELECT "product_categories".* FROM "product_categories"

  def create
    @product_category = ProductCategory.new(product_category_params)

    respond_to do |format|
      if @product_category.save
---
INSERT INTO "product_categories" ("name", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "1qw2"], ["tag_id", 4], ["created_at", "2020-11-21 19:03:57.121995"], ["updated_at", "2020-11-21 19:03:57.121995"]]

    def set_product_category
      @product_category = ProductCategory.find(params[:id])
---
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]