app/controllers/products_controller.rb

  def index
    binding.pry
    if params["filter_products"] and !params["filter_products"]["catagory_id"].blank?
      @products = ProductCategory.find(params["filter_products"]["catagory_id"]).tag.products
    else
      @products = Product.all.includes(:tags)
---
SELECT "products".* FROM "products"
SELECT "prod_tags".* FROM "prod_tags" WHERE "prod_tags"."product_id" IN ($1, $2, $3, $4)  [["product_id", 1], ["product_id", 2], ["product_id", 3], ["product_id", 4]]
SELECT "products".* FROM "products" INNER JOIN "product_tags" ON "products"."id" = "product_tags"."product_id" WHERE "product_tags"."tag_id" = $1  [["tag_id", 4]]
SELECT "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "tags".* FROM "tags"

  def create
    @product = Product.new(name: product_params["name"], description: product_params["description"])
    respond_to do |format|
      if @product.save
        p_tags = product_params["p_tag"].split(",").map{ |p| p.strip }
        p_tags.each{ |p| t = Tag.find_or_create_by(name: p); @product.tags << t}
---
INSERT INTO "products" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "wqer"], ["description", "efrq"], ["created_at", "2020-11-21 20:00:56.902819"], ["updated_at", "2020-11-21 20:00:56.902819"]]
INSERT INTO "prod_tags" ("product_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 4], ["tag_id", 1], ["created_at", "2020-11-23 06:48:40.840301"], ["updated_at", "2020-11-23 06:48:40.840301"]]
INSERT INTO "product_tags" ("product_id", "tag_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["product_id", 13], ["tag_id", 6], ["created_at", "2020-11-21 20:00:56.913122"], ["updated_at", "2020-11-21 20:00:56.913122"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "wed"], ["created_at", "2020-11-21 20:00:56.908402"], ["updated_at", "2020-11-21 20:00:56.908402"]]
SELECT "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "wed"], ["LIMIT", 1]]