app/views/products/index.html.erb

SELECT "product_categories".* FROM "product_categories" ORDER BY "product_categories"."name" ASC
---
    <p> Filter based on catogary</p>
    <%= form.collection_select :catagory_id, ProductCategory.order(:name),:id,:name ,:prompt => "Select"%>

SELECT "prod_tags".* FROM "prod_tags" WHERE "prod_tags"."product_id" IN ($1, $2, $3, $4)  [["product_id", 1], ["product_id", 2], ["product_id", 3], ["product_id", 4]]
SELECT "tags".* FROM "tags" INNER JOIN "product_tags" ON "tags"."id" = "product_tags"."tag_id" WHERE "product_tags"."product_id" = $1  [["product_id", 1]]
---
        <td><%= product.description %></td>
        <td><%= product.tags.map { |t| t.name }.join(",") %></td>